
--
-- "告诉李天佑，不惜一切代价守住。"
--

DROP TABLE IF EXISTS metro_line_01;
DROP TABLE IF EXISTS metro_line_02;
DROP TABLE IF EXISTS metro_line_03;
DROP TABLE IF EXISTS metro_line_04;
DROP TABLE IF EXISTS metro_line_05;
DROP TABLE IF EXISTS metro_line_06;
DROP TABLE IF EXISTS metro_line_07;
DROP TABLE IF EXISTS metro_line_08;
DROP TABLE IF EXISTS metro_line_09;
DROP TABLE IF EXISTS metro_line_10;
DROP TABLE IF EXISTS metro_line_11;
DROP TABLE IF EXISTS metro_line_12;
DROP TABLE IF EXISTS metro_line_13;
DROP TABLE IF EXISTS metro_line_15;
DROP TABLE IF EXISTS metro_line_16;
DROP TABLE IF EXISTS metro_line_17;
DROP TABLE IF EXISTS metro_line_18;
DROP TABLE IF EXISTS metro_line_pj;
DROP TABLE IF EXISTS metro_line;

--  1 号线

CREATE TABLE IF NOT EXISTS metro_line_01(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_01(p1,p2,dut)
            VALUES ('富锦路',           '友谊西路',         180),
                   ('友谊西路',         '宝安公路',         147),
                   ('宝安公路',         '共富新村',         124),
                   ('共富新村',         '呼兰路',           150),
                   ('呼兰路',           '通河新村',         158),
                   ('通河新村',         '共康路',           138),
                   ('共康路',           '彭浦新村',         118),
                   ('彭浦新村',         '汶水路',           132),
                   ('汶水路',           '上海马戏城',       146),
                   ('上海马戏城',       '延长路',           95),
                   ('延长路',           '中山北路',         114),
                   ('中山北路',         '上海火车站',       123),
                   ('上海火车站',       '汉中路',           142),
                   ('汉中路',           '新闸路',           125),
                   ('新闸路',           '人民广场',         156),
                   ('人民广场',         '一大会址·黄陂南路', 97),
                   ('一大会址·黄陂南路', '陕西南路',         264),
                   ('陕西南路',         '常熟路',           124),
                   ('常熟路',           '衡山路',           156),
                   ('衡山路',           '徐家汇',           142),
                   ('徐家汇',           '上海体育馆',       115),
                   ('上海体育馆',       '漕宝路',           127),
                   ('漕宝路',           '上海南站',         107),
                   ('上海南站',         '锦江乐园',         112),
                   ('锦江乐园',         '莲花路',           136),
                   ('莲花路',           '外环路',           130),
                   ('外环路',           '莘庄',             157);

--  2 号线

CREATE TABLE IF NOT EXISTS metro_line_02(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_02(p1,p2,dut)
            VALUES ('徐泾东',           '虹桥火车站',       180),
                   ('虹桥火车站',       '虹桥2号航站楼',    168),
                   ('虹桥2号航站楼',    '淞虹路',           179),
                   ('淞虹路',           '北新路',           246),
                   ('北新路',           '威宁路',           310),
                   ('威宁路',           '娄山关路',         314),
                   ('娄山关路',         '中山公园',         178),
                   ('中山公园',         '江苏路',           146),
                   ('江苏路',           '静安寺',           179),
                   ('静安寺',           '南京西路',         243),
                   ('南京西路',         '人民广场',         238),
                   ('人民广场',         '南京东路',         149),
                   ('南京东路',         '陆家嘴',           121),
                   ('陆家嘴',           '东昌路',           138),
                   ('东昌路',           '世纪大道',         269),
                   ('世纪大道',         '上海科技馆',       256),
                   ('上海科技馆',       '世纪公园',         278),
                   ('世纪公园',         '龙阳路',           298),
                   ('龙阳路',           '张江高科',         247),
                   ('张江高科',         '金科路',           189),
                   ('金科路',           '广兰路',           310),
                   ('广兰路',           '唐镇',             302),
                   ('唐镇',             '创新中路',         295),
                   ('创新中路',         '华夏东路',         248),
                   ('华夏东路',         '川沙',              297),
                   ('川沙',             '凌空路',           398),
                   ('凌空路',           '远东大道',         364),
                   ('远东大道',         '海天三路',         354),
                   ('海天三路',         '浦东国际机场',     410);

--  3 号线

CREATE TABLE IF NOT EXISTS metro_line_03(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_03(p1,p2,dut)
            VALUES ('上海南路',         '石龙路',           380),
                   ('石龙路',           '龙漕路',           368),
                   ('龙漕路',           '漕溪路',           389),
                   ('漕溪路',           '宜山路',           397),
                   ('宜山路',           '虹桥路',           345),
                   ('虹桥路',           '延安西路',         312),
                   ('延安西路',         '中山公园',         286),
                   ('中山公园',         '金沙江路',         276),
                   ('金沙江路',         '曹杨路',           285),
                   ('曹杨路',           '镇坪路',           274),
                   ('镇坪路',           '中潭路',           246),
                   ('中潭路',           '上海火车站',       251),
                   ('上海火车站',       '宝山路',           249),
                   ('宝山路',           '东宝兴路',         247),
                   ('东宝兴路',         '虹口足球场',       310),
                   ('虹口足球场',       '赤峰路',           268),
                   ('赤峰路',           '大柏树',           279),
                   ('大柏树',           '江湾镇',           274),
                   ('江湾镇',           '殷高西路',         288),
                   ('殷高西路',         '长江南路',         310),
                   ('长江南路',         '淞发路',           302),
                   ('淞发路',           '张发浜',           297),
                   ('张发浜',           '淞滨路',           245),
                   ('淞滨路',           '水产路',           289),
                   ('水产路',           '宝杨路',           248),
                   ('宝杨路',           '友谊路',           284),
                   ('友谊路',           '铁力路',           247),
                   ('铁力路',           '江杨北路',         250);

--  4 号线

CREATE TABLE IF NOT EXISTS metro_line_04(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_04(p1,p2,dut)
            VALUES ('上海体育馆',       '宜山路',           180),
                   ('宜山路',           '虹桥路',           345),
                   ('虹桥路',           '延安西路',         312),
                   ('延安西路',         '中山公园',         286),
                   ('中山公园',         '金沙江路',         276),
                   ('金沙江路',         '曹杨路',           285),
                   ('曹杨路',           '镇坪路',           274),
                   ('镇坪路',           '中潭路',           246),
                   ('中潭路',           '上海火车站',       251),
                   ('上海火车站',       '宝山路',           249),
                   ('宝山路',           '海伦路',           147),
                   ('海伦路',           '临平路',           210),
                   ('临平路',           '大连路',           245),
                   ('大连路',           '杨树浦路',         243),
                   ('杨树浦路',         '浦东大道',         234),
                   ('浦东大道',         '世纪大道',         189),
                   ('世纪大道',         '浦电路',           178),
                   ('浦电路',           '蓝村路',           240),
                   ('蓝村路',           '塘桥',             210),
                   ('塘桥',             '南浦大桥',         204),
                   ('南浦大桥',         '西藏南路',         207),
                   ('西藏南路',         '鲁班路',           201),
                   ('鲁班路',           '大木桥路',         271),
                   ('大木桥路',         '东安路',           279),
                   ('东安路',           '上海体育场',       281);

--  5 号线

CREATE TABLE IF NOT EXISTS metro_line_05(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_05(p1,p2,dut)
            VALUES ('莘庄',             '春申路',           280),
                   ('春申路',           '银都路',           245),
                   ('银都路',           '颛桥',             274),
                   ('颛桥',             '北桥',             246),
                   ('北桥',             '剑川路',           210),
                   ('剑川路',           '东川路',           216),
                   ('东川路',           '金平路',           222),
                   ('金平路',           '华宁路',           210),
                   ('华宁路',           '文井路',           214),
                   ('文井路',           '闵行开发区',       219),
                   ('闵行开发区',       '江川路',           201),
                   ('江川路',           '西渡',             205),
                   ('西渡',             '萧塘',             218),
                   ('萧塘',             '奉浦大道',         208),
                   ('奉浦大道',         '环城东路',         301),
                   ('环城东路',         '望园路',           312),
                   ('望园路',           '金海湖',           304),
                   ('金海路',           '奉贤新城',         310);

--  6 号线

CREATE TABLE IF NOT EXISTS metro_line_06(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_06(p1,p2,dut)
            VALUES ('东方体育中心',     '灵岩南路',         310),
                   ('灵岩南路',         '上南路',           265),
                   ('上南路',           '华夏西路',         271),
                   ('华夏西路',         '高青路',           246),
                   ('高青路',           '东明路',           257),
                   ('东明路',           '高科西路',         249),
                   ('高科西路',         '临沂新村',         231),
                   ('临沂新村',         '上海儿童医学中心',  254),
                   ('上海儿童医学中心', '蓝村路',           198),
                   ('蓝村路',           '浦电路',           210),
                   ('浦电路',           '世纪大道',         215),
                   ('世纪大道',         '源深体育中心',     224),
                   ('源深体育中心',     '民生路',           187),
                   ('民生路',           '北洋泾路',         178),
                   ('北洋泾路',         '德平路',           168),
                   ('德平路',           '云山路',           204),
                   ('云山路',           '金桥路',           241),
                   ('金桥路',           '博兴路',           231),
                   ('博兴路',           '五莲路',           211),
                   ('五莲路',           '巨峰路',           216),
                   ('巨峰路',           '东靖路',           220),
                   ('东靖路',           '五洲大道',         238),
                   ('五洲大道',         '洲海路',           235),
                   ('洲海路',           '外高桥保税区南站',  256),
                   ('外高桥保税区南站',  '航津路',           271),
                   ('航津路',           '外高桥保税区北站',  267),
                   ('外高桥保税区北站', '港城路',            312);

--  7 号线

CREATE TABLE IF NOT EXISTS metro_line_07(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_07(p1,p2,dut)
            VALUES ('美兰湖',           '罗南新村',         210),
                   ('罗南新村',         '潘广路',           212),
                   ('潘广路',           '刘行',             195),
                   ('刘行',             '顾村公园',         189),
                   ('顾村公园',         '祁华路',           191),
                   ('祁华路',           '上海大学',         202),
                   ('上海大学',         '南陈路',           211),
                   ('南陈路',           '上大路',           201),
                   ('上大路',           '场中路',           199),
                   ('场中路',           '大场镇',           215),
                   ('大场镇',           '行知路',           207),
                   ('行知路',           '大华三路',         200),
                   ('大华三路',         '新村路',           203),
                   ('新村路',           '岚皋路',           169),
                   ('岚皋路',           '镇坪路',           178),
                   ('镇坪路',           '长寿路',           196),
                   ('长寿路',           '昌平路',           188),
                   ('昌平路',           '静安寺',           178),
                   ('静安寺',           '常熟路',           181),
                   ('常熟路',           '肇嘉浜路',         190),
                   ('肇嘉浜路',         '东安路',           187),
                   ('东安路',           '龙华中路',         177),
                   ('龙华中路',         '后滩',             210),
                   ('后滩',             '长清路',           213),
                   ('长清路',           '耀华路',           209),
                   ('耀华路',           '云台路',           201),
                   ('云台路',           '高科西路',         217),
                   ('高科西路',         '杨高南路',         280),
                   ('杨高南路',         '锦绣路',           259),
                   ('锦绣路',           '芳华路',           267),
                   ('芳华路',           '龙阳路',           271),
                   ('龙阳路',           '花木路',           257);

--  8 号线

CREATE TABLE IF NOT EXISTS metro_line_08(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_08(p1,p2,dut)
            VALUES ('沈杜公路',         '联航路',           310),
                   ('联航路',           '江月路',           322),
                   ('江月路',           '浦江镇',           318),
                   ('浦江镇',           '芦恒路',           325),
                   ('芦恒路',           '凌兆新村',         312),
                   ('凌兆新村',         '东方体育中心',     314),
                   ('东方体育中心',     '杨思',             302),
                   ('杨思',             '成山路',           308),
                   ('成山路',           '耀华路',           299),
                   ('耀华路',           '中华艺术宫',       305),
                   ('中华艺术宫',       '西藏南路',         285),
                   ('西藏南路',         '陆家浜路',         271),
                   ('陆家浜路',         '老西门',           287),
                   ('老西门',           '大世界',           283),
                   ('大世界',           '人民广场',         279),
                   ('人民广场',         '曲阜路',           265),
                   ('曲阜路',           '中兴路',           261),
                   ('中兴路',           '西藏北路',         256),
                   ('西藏北路',         '虹口足球场',       260),
                   ('虹口足球场',       '曲阳路',           271),
                   ('曲阳路',           '四平路',           276),
                   ('四平路',           '鞍山新村',         282),
                   ('鞍山新村',         '江浦路',           284),
                   ('江浦路',           '黄兴路',           280),
                   ('黄兴路',           '延吉中路',         295),
                   ('延吉中路',         '黄兴公园',         305),
                   ('黄兴公园',         '翔殷路',           310),
                   ('翔殷路',           '嫩江路',           308),
                   ('嫩江路',           '市光路',           319);

--  9 号线

CREATE TABLE IF NOT EXISTS metro_line_09(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_09(p1,p2,dut)
            VALUES ('松江南站',         '醉白池',           326),
                   ('醉白池',           '松江体育中心',     321),
                   ('松江体育中心',     '松江新城',         318),
                   ('松江新城',         '松江大学城',       324),
                   ('松江大学城',       '洞泾',             314),
                   ('洞泾',             '佘山',            310),
                   ('佘山',             '泗泾',            320),
                   ('泗泾',             '九亭',            311),
                   ('九亭',             '中春路',          289),
                   ('中春路',           '七宝',            279),
                   ('七宝',             '星中路',          284),
                   ('星中路',           '合川路',          273),
                   ('合川路',           '漕河泾开发区',     272),
                   ('漕河泾开发区',     '桂林路',           268),
                   ('桂林路',           '宜山路',          288),
                   ('宜山路',           '徐家汇',          294),
                   ('徐家汇',           '肇嘉浜路',        254),
                   ('肇嘉浜路',         '嘉善路',          266),
                   ('嘉善路',           '打浦桥',          278),
                   ('打浦桥',           '马当路',          292),
                   ('马当路',           '陆家浜路',        287),
                   ('陆家浜路',         '小南门',          277),
                   ('小南门',           '商城路',          267),
                   ('商城路',           '世纪大道',        281),
                   ('世纪大道',         '杨高中路',        274),
                   ('杨高中路',         '芳甸路',          285),
                   ('芳甸路',           '蓝天路',          281),
                   ('蓝天路',           '台儿庄路',        294),
                   ('台儿庄路',         '金桥',            297),
                   ('金桥',             '金吉路',          287),
                   ('金吉路',           '金海路',          291),
                   ('金海路',           '顾唐路',          306),
                   ('顾唐路',           '民雷路',          315),
                   ('民雷路',           '曹路',            324);

--  10 号线

CREATE TABLE IF NOT EXISTS metro_line_10(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_10(p1,p2,dut)
            VALUES ('航中路',           '紫藤路',           278),
                   ('紫藤路',           '龙柏新村',         249),
                   ('龙柏新村',         '虹桥火车站',       257),
                   ('虹桥火车站',       '虹桥2号航站楼',     266),
                   ('虹桥2号航站楼',    '虹桥1号航站楼',     275),
                   ('虹桥1号航站楼',    '上海动物园',        271),
                   ('上海动物园',       '龙溪路',           266),
                   ('龙溪路',           '水城路',           268),
                   ('水城路',           '伊犁路',           274),
                   ('伊犁路',           '宋园路',           264),
                   ('宋园路',           '虹桥路',           261),
                   ('虹桥路',           '交通大学',         257),
                   ('交通大学',         '上海图书馆',       260),
                   ('上海图书馆',       '陕西南路',         246),
                   ('陕西南路',         '一大会址·新天地',  243),
                   ('一大会址·新天地',  '老西门',           241),
                   ('老西门',           '豫园',            222),
                   ('豫园',             '南京东路',        210),
                   ('南京东路',         '天潼路',           213),
                   ('天潼路',           '四川北路',         197),
                   ('四川北路',         '海伦路',           205),
                   ('海伦路',           '邮电新村',         211),
                   ('邮电新村',         '四平路',           208),
                   ('四平路',           '同济大学',         217),
                   ('同济大学',         '国权路',           207),
                   ('国权路',           '五角场',           214),
                   ('五角场',           '江湾体育场',       224),
                   ('江湾体育场',       '三门路',           231),
                   ('三门路',           '殷高东路',         255),
                   ('殷高东路',         '新江湾城',         246),
                   ('新江湾城',         '国帆路',           251),
                   ('国帆路',           '双江路',           276),
                   ('双江路',           '高桥西',           247),
                   ('高桥西',           '高桥',             261),
                   ('高桥',             '港城路',           272),
                   ('港城路',           '基隆路',           275);

--  11 号线

CREATE TABLE IF NOT EXISTS metro_line_11(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_11(p1,p2,dut)
            VALUES ('花桥路',           '光明路',           218),
                   ('光明路',           '兆丰路',           210),
                   ('兆丰路',           '安亭',             217),
                   ('安亭',             '上海汽车城',       225),
                   ('上海汽车城',       '昌吉东路',         223),
                   ('昌吉东路',         '上海赛车场',       221),
                   ('上海赛车场',       '嘉定北',           227),
                   ('嘉定北',           '嘉定西',           231),
                   ('嘉定西',           '白银路',           219),
                   ('白银路',           '嘉定新城',         202),
                   ('嘉定新城',         '马陆',             216),
                   ('马陆',             '陈翔公路',         213),
                   ('陈翔公路',         '南翔',             209),
                   ('南翔',             '桃浦新村',         195),
                   ('桃浦新村',         '武威路',           199),
                   ('武威路',           '祁连山路',         201),
                   ('祁连山路',         '李子园',           188),
                   ('李子园',           '上海西站',         187),
                   ('上海西站',         '真如',             192),
                   ('真如',             '枫桥路',           175),
                   ('枫桥路',           '曹杨路',           181),
                   ('曹杨路',           '隆德路',           193),
                   ('隆德路',           '江苏路',           176),
                   ('江苏路',           '交通大学',         185),
                   ('交通大学',         '徐家汇',           179),
                   ('徐家汇',           '上海游泳馆',       190),
                   ('上海游泳馆',       '龙华',             182),
                   ('龙华',             '云锦路',           177),
                   ('云锦路',           '龙耀路',           189),
                   ('龙耀路',           '东方体育中心',     201),
                   ('东方体育中心',     '三林',             212),
                   ('三林',             '三林东',           208),
                   ('三林东',           '浦三路',           212),
                   ('浦三路',           '御桥',             221),
                   ('御桥',             '罗山路',           204),
                   ('罗山路',           '秀沿路',           217),
                   ('秀沿路',           '康新公路',         213),
                   ('康新公路',         '迪士尼',           222);

--  12 号线

CREATE TABLE IF NOT EXISTS metro_line_12(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_12(p1,p2,dut)
            VALUES ('七莘路',           '虹莘路',           318),
                   ('虹莘路',           '顾戴路',           300),
                   ('顾戴路',           '东兰路',           307),
                   ('东兰路',           '虹梅路',           312),
                   ('虹梅路',           '虹漕路',           304),
                   ('虹漕路',           '桂林公园',         306),
                   ('桂林公园',         '漕宝路',           301),
                   ('漕宝路',           '龙漕路',           298),
                   ('龙漕路',           '龙华',             295),
                   ('龙华',             '龙华中路',         288),
                   ('龙华中路',         '大木桥路',         290),
                   ('大木桥路',         '嘉善路',           281),
                   ('嘉善路',           '陕西南路',         277),
                   ('陕西南路',         '南京西路',         265),
                   ('南京西路',         '汉中路',           267),
                   ('汉中路',           '曲阜路',           255),
                   ('曲阜路',           '天潼路',           249),
                   ('天潼路',           '国际客运中心',     251),
                   ('国际客运中心',     '提篮桥',           244),
                   ('提篮桥',           '大连路',           233),
                   ('大连路',           '江浦公园',         241),
                   ('江浦公园',         '宁国路',           239),
                   ('宁国路',           '隆昌路',           234),
                   ('隆昌路',           '爱国路',           222),
                   ('爱国路',           '复兴岛',           233),
                   ('复兴岛',           '东陆路',           244),
                   ('东陆路',           '巨峰路',           249),
                   ('巨峰路',           '杨高北路',         257),
                   ('杨高北路',         '金京路',           266),
                   ('金京路',           '申江路',           298),
                   ('申江路',           '金海路',           308);

--  13 号线

CREATE TABLE IF NOT EXISTS metro_line_13(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_13(p1,p2,dut)
            VALUES ('金运路',           '金沙江西路',       307),
                   ('金沙江西路',       '丰庄',             301),
                   ('丰庄',             '祁连山南路',       287),
                   ('祁连山南路',       '真北路',           294),
                   ('真北路',           '大渡河路',         288),
                   ('大渡河路',         '金沙江路',         285),
                   ('金沙江路',         '隆德路',           265),
                   ('隆德路',           '武宁路',           284),
                   ('武宁路',           '长寿路',           277),
                   ('长寿路',           '江宁路',           274),
                   ('江宁路',           '汉中路',           270),
                   ('汉中路',           '自然博物馆',       264),
                   ('自然博物馆',       '南京西路',         255),
                   ('南京西路',         '淮海中路',         239),
                   ('淮海中路',         '一大会址·新天地',  244),
                   ('一大会址·新天地',  '马当路',           256),
                   ('马当路',           '世博会博物馆',     267),
                   ('世博会博物馆',     '世博大道',         256),
                   ('世博大道',         '长清路',           266),
                   ('长清路',           '成山路',           243),
                   ('成山路',           '东明路',           249),
                   ('东明路',           '华鹏路',           226),
                   ('华鹏路',           '下南路',           220),
                   ('下南路',           '北蔡',             212),
                   ('北蔡',             '陈春路',           198),
                   ('陈春路',           '莲溪路',           205),
                   ('莲溪路',           '华夏中路',         209),
                   ('华夏中路',         '中科路',           214),
                   ('中科路',           '学林路',           219),
                   ('学林路',           '张江路',           225);

--  15 号线

CREATE TABLE IF NOT EXISTS metro_line_15(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_15(p1,p2,dut)
            VALUES ('紫竹高新区',       '永德路',           287),
                   ('永德路',           '元江路',           301),
                   ('元江路',           '双柏路',           294),
                   ('双柏路',           '曙建路',           277),
                   ('曙建路',           '景西路',           290),
                   ('景西路',           '虹梅南路',         288),
                   ('虹梅南路',         '华泾西',           279),
                   ('华泾西',           '朱梅路',           266),
                   ('朱梅路',           '罗秀路',           265),
                   ('罗秀路',           '华东理工大学',     256),
                   ('华东理工大学',     '上海南站',         244),
                   ('上海南站',         '桂林公园',         256),
                   ('桂林公园',         '桂林路',           250),
                   ('桂林路',           '吴中路',           248),
                   ('吴中路',           '姚虹路',           233),
                   ('姚虹路',           '红宝石路',         222),
                   ('红宝石路',         '娄山关路',         255),
                   ('娄山关路',         '长风公园',         212),
                   ('长风公园',         '大渡河路',         227),
                   ('大渡河路',         '梅岭北路',         230),
                   ('梅岭北路',         '铜川路',           241),
                   ('铜川路',           '上海西站',         255),
                   ('上海西站',         '武威东路',         274),
                   ('武威东路',         '古浪路',           261),
                   ('古浪路',           '祁安路',           279),
                   ('祁安路',           '南大路',           281),
                   ('南大路',           '丰翔路',           276),
                   ('丰翔路',           '锦秋路',           284),
                   ('锦秋路',           '顾村公园',         275);

--  16 号线

CREATE TABLE IF NOT EXISTS metro_line_16(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_16(p1,p2,dut)
            VALUES ('龙阳路',       '华夏中路',         514),
                   ('华夏中路',     '罗山路',           602),
                   ('罗山路',       '周浦东',           691),
                   ('周浦东',       '鹤沙航城',         788),
                   ('鹤沙航城',     '航头东',           679),
                   ('航头东',       '新场',             748),
                   ('新场',         '野生动物园',       816),
                   ('野生动物园',   '惠南',             842),
                   ('惠南',         '惠南东',           641),
                   ('惠南东',       '书院',             777),
                   ('书院',         '临港大道',         781),
                   ('临港大道',     '滴水湖',           697);

--  17 号线

CREATE TABLE IF NOT EXISTS metro_line_17(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_17(p1,p2,dut)
            VALUES ('虹桥火车站',       '诸光路',       312),
                   ('诸光路',           '蟠龙路',       302),
                   ('蟠龙路',           '徐盈路',       268),
                   ('徐盈路',           '徐泾北城',     287),
                   ('徐泾北城',         '嘉松中路',     267),
                   ('嘉松中路',         '赵巷',         255),
                   ('赵巷',             '汇金路',       259),
                   ('汇金路',           '青浦新城',     284),
                   ('青浦新城',         '漕盈路',       291),
                   ('漕盈路',           '淀山湖大道',   305),
                   ('淀山湖大道',       '朱家角',       307),
                   ('朱家角',           '东方绿舟',     316);

--  18 号线

CREATE TABLE IF NOT EXISTS metro_line_18(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_18(p1,p2,dut)
            VALUES ('航头',         '下沙',         301),
                   ('下沙',         '鹤涛路',       287),
                   ('鹤涛路',       '沈海路',       259),
                   ('沈海路',       '繁荣路',       263),
                   ('繁荣路',       '周浦',         282),
                   ('周浦',         '康桥',         299),
                   ('康桥',         '御桥',         306);


--  浦江线

CREATE TABLE IF NOT EXISTS metro_line_pj(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_pj(p1,p2,dut)
            VALUES ('沈杜公路',      '三鲁公路',     679),
                   ('三鲁公路',      '闵瑞路',       687),
                   ('闵瑞路',        '浦航路',       691),
                   ('浦航路',        '东城一路',     637),
                   ('东城一路',      '汇臻路',       655);


-- 总表

CREATE TABLE IF NOT EXISTS metro_line(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line(p1,p2,dut)
    SELECT p1,p2,dut FROM metro_line_01 UNION
    SELECT p1,p2,dut FROM metro_line_02 UNION
    SELECT p1,p2,dut FROM metro_line_03 UNION
    SELECT p1,p2,dut FROM metro_line_04 UNION
    SELECT p1,p2,dut FROM metro_line_05 UNION
    SELECT p1,p2,dut FROM metro_line_06 UNION
    SELECT p1,p2,dut FROM metro_line_07 UNION
    SELECT p1,p2,dut FROM metro_line_08 UNION
    SELECT p1,p2,dut FROM metro_line_09 UNION
    SELECT p1,p2,dut FROM metro_line_10 UNION
    SELECT p1,p2,dut FROM metro_line_11 UNION
    SELECT p1,p2,dut FROM metro_line_12 UNION
    SELECT p1,p2,dut FROM metro_line_13 UNION
    SELECT p1,p2,dut FROM metro_line_15 UNION
    SELECT p1,p2,dut FROM metro_line_16 UNION
    SELECT p1,p2,dut FROM metro_line_17 UNION
    SELECT p1,p2,dut FROM metro_line_18 UNION
    SELECT p1,p2,dut FROM metro_line_pj;

\COPY (WITH t AS (SELECT * FROM metro_line) SELECT array_to_json(array_agg(row_to_json(t))) FROM t) TO '/tmp/metro.json';

-- 测试

DROP TABLE IF EXISTS metro_line_tt;

CREATE TABLE IF NOT EXISTS metro_line_tt(
    id   SERIAL,
    p1   VARCHAR(128) NOT NULL,      -- 端点 1
    p2   VARCHAR(128) NOT NULL,      -- 端点 2
    dut  INTEGER      NOT NULL,      -- 耗时(秒计)
    dis  INTEGER,                    -- 距离(米计)
    lnos VARCHAR(16)[],              -- 所在线路
    PRIMARY KEY(id)
);

INSERT INTO metro_line_tt(p1,p2,dut)
            VALUES ('长寿路',      '江宁路',     10),
                   ('江宁路',      '汉中路',     20),
                   ('汉中路',      '新闸路',     30),
                   ('新闸路',      '人民广场',   40),
                   ('人民广场',    '南京西路',   50),
                   ('南京西路',     '静安寺',    60),
                   ('静安寺',       '昌平路',    70),
                   ('昌平路',       '长寿路',    80),
                   ('南京西路',     '陕西南路',  90),
                   ('陕西南路',     '黄陂南路',  100),
                   ('黄陂南路',     '人民广场',  110),
                   ('汉中路',       '南京西路',  120),
                   ('南京西路',     '淮海中路',   130),
                   ('淮海中路',     '新天地',     140),
                   ('新天地',       '陕西南路',   150),
                   ('陕西南路',     '常熟路',     160),
                   ('汉中路',       '曲阜路',     170),
                   ('曲阜路',       '人民广场',   180),
                   ('汉中路',       '自然博物馆', 190),
                   ('自然博物馆',    '南京西路',  200),
                   ('常熟路',        '静安寺',    210);

\COPY (WITH t AS (SELECT * FROM metro_line_tt) SELECT array_to_json(array_agg(row_to_json(t))) FROM t) TO '/tmp/metro_tt.json';
